; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v5 ?v9)
             (pred_7 ?v11 ?v10)
             (pred_2 ?v5 ?v10)
             (pred_4 ?v6 ?v5 )
	     (pred_8 ?v5)
             (pred_9 ?v7)
             (pred_11 ?v11)
             (pred_10 ?v10)
             (pred_3 ?v5)
             (pred_1 ?v11)
             (pred_12 ?v5)
             (pred_6 ))



(:action op_4
:parameters (?v3 ?v8 ?v1 ?v13)
:precondition (and (pred_9 ?v3) (pred_9 ?v8) (pred_11 ?v1) (pred_10 ?v13)
          (pred_5 ?v3 ?v8) (pred_7 ?v1 ?v13)
                   (pred_2 ?v8 ?v13) (pred_8 ?v3) 
                   (pred_3 ?v8) (pred_1 ?v1))
:effect (and  (pred_12 ?v8) (not (pred_3 ?v8))))


(:action op_2
:parameters (?v3 ?v12)
:precondition (and (pred_9 ?v3) (pred_9 ?v12)
               (pred_8 ?v3) (pred_5 ?v3 ?v12) (pred_12 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v3))))

(:action op_5
:parameters (?v3 ?v1)
:precondition (and (pred_9 ?v3) (pred_11 ?v1) 
                  (pred_8 ?v3) (pred_4 ?v1 ?v3) (pred_6 ))
:effect (and (pred_1 ?v1)
   (not (pred_4 ?v1 ?v3)) (not (pred_6 ))))


(:action op_3
:parameters (?v3 ?v4 ?v2)
:precondition (and (pred_9 ?v3) (pred_11 ?v4) (pred_11 ?v2)
                  (pred_8 ?v3) (pred_1 ?v2) (pred_4 ?v4 ?v3))
:effect (and (pred_1 ?v4) (pred_4 ?v2 ?v3)
        (not (pred_1 ?v2)) (not (pred_4 ?v4 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_9 ?v3) (pred_11 ?v1) 
                  (pred_8 ?v3) (pred_1 ?v1))
:effect (and (pred_6 ) (pred_4 ?v1 ?v3) (not (pred_1 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_04 obj_05 obj_02 obj_03 obj_17 obj_01 obj_18 obj_21 obj_09 obj_06 obj_16 obj_15 obj_13 obj_08 obj_10
    obj_11 obj_19
    obj_20 obj_14 obj_12
    )

    (:init
       (pred_6)

       (pred_9 obj_07)
       (pred_9 obj_04)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_11 obj_20)
       (pred_11 obj_14)
       (pred_11 obj_12)

       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_03 obj_21)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_17 obj_01)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_01 obj_06)
       (pred_5 obj_01 obj_18)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_17)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_02)
       (pred_5 obj_18 obj_01)
       (pred_5 obj_21 obj_15)
       (pred_5 obj_21 obj_09)
       (pred_5 obj_21 obj_03)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_17)
       (pred_5 obj_09 obj_21)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_06 obj_16)
       (pred_5 obj_06 obj_01)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_06)
       (pred_5 obj_15 obj_13)
       (pred_5 obj_15 obj_21)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_13 obj_15)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_15)
       (pred_3 obj_03)
       (pred_2  obj_21 obj_11)
       (pred_2  obj_15 obj_19)
       (pred_2  obj_03 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_04)
       (pred_12 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_18)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_16)
       (pred_12 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_10)

       (pred_7  obj_20 obj_11)
       (pred_7  obj_14 obj_19)
       (pred_7  obj_12 obj_11)
       (pred_4 obj_20 obj_18)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_12 obj_08)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_4 obj_12 obj_17)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_2 obj_16 obj_10)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_10)
   goals met: 0 of 1
2. (op_2 obj_10 obj_08)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_12)
   deleted: (pred_4 obj_12 obj_08) (pred_6)
   added: (pred_1 obj_12)
   goals met: 0 of 1
4. (op_2 obj_08 obj_13)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_13)
   goals met: 0 of 1
5. (op_2 obj_13 obj_09)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_09)
   goals met: 0 of 1
6. (op_2 obj_09 obj_17)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_17)
   goals met: 0 of 1
7. (op_1 obj_17 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_6) (pred_4 obj_12 obj_17)
   goals met: 1 of 1
